; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph0 - mode
	infrared3 - mode
	image2 - mode
	image1 - mode
	Star1 - direction
	GroundStation2 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star3 - direction
	GroundStation0 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 image2)
	(supports instrument1 infrared3)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon11)
	(supports instrument2 spectrograph0)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star15)
	(supports instrument3 image2)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star3)
	(calibration_target instrument3 Star9)
	(supports instrument4 image1)
	(supports instrument4 image2)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
)
(:goal (and
	(pointing satellite1 Star1)
	(pointing satellite2 Phenomenon13)
	(have_image Phenomenon10 image2)
	(have_image Phenomenon11 image1)
	(have_image Star12 image1)
	(have_image Phenomenon13 infrared3)
	(have_image Star14 infrared3)
	(have_image Star15 infrared3)
	(have_image Star16 spectrograph0)
))

)

; plan
1. (turn_to satellite2 phenomenon13 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon13)
   goals met: 1 of 9
2. (turn_to satellite1 groundstation6 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 groundstation6)
   goals met: 1 of 9
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 9
4. (calibrate satellite1 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 1 of 9
5. (turn_to satellite1 phenomenon10 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 9
6. (turn_to satellite0 groundstation5 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 groundstation5)
   goals met: 1 of 9
7. (take_image satellite1 phenomenon10 instrument2 image2)
   added: (have_image phenomenon10 image2)
   goals met: 2 of 9
8. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 9
9. (calibrate satellite0 instrument1 groundstation5)
   added: (calibrated instrument1)
   goals met: 2 of 9
10. (turn_to satellite0 phenomenon11 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 9
11. (take_image satellite0 phenomenon11 instrument1 image1)
   added: (have_image phenomenon11 image1)
   goals met: 3 of 9
12. (turn_to satellite0 phenomenon13 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 9
13. (take_image satellite0 phenomenon13 instrument1 infrared3)
   added: (have_image phenomenon13 infrared3)
   goals met: 4 of 9
14. (turn_to satellite0 star12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star12)
   goals met: 4 of 9
15. (take_image satellite0 star12 instrument1 image1)
   added: (have_image star12 image1)
   goals met: 5 of 9
16. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 5 of 9
17. (take_image satellite0 star14 instrument1 infrared3)
   added: (have_image star14 infrared3)
   goals met: 6 of 9
18. (turn_to satellite0 star15 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star15)
   goals met: 6 of 9
19. (take_image satellite0 star15 instrument1 infrared3)
   added: (have_image star15 infrared3)
   goals met: 7 of 9
20. (turn_to satellite1 star16 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star16)
   goals met: 7 of 9
21. (take_image satellite1 star16 instrument2 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 8 of 9
22. (turn_to satellite1 star1 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star1)
   goals met: 9 of 9
